IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0g1x0x_g3x0x/SYSCTL_1.0.xml
    <register id="SYSCTL_MGMT_ANACOMP0_STAT" width="32" offset="0x8814" description="IP State Register - Read Only">
        <bitfield id="RESETSTKY" description="IP has been Reset" begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="clear" value="0x0" description=""/>
            <bitenum id="Set" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_ANACOMP1_PWREN" width="32" offset="0xA800" description="IP Enable Register">
        <bitfield id="ENABLE" description="IP Enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="Disable" value="0x0" description=""/>
            <bitenum id="Enable" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_ANACOMP1_RSTCTL" width="32" offset="0xA804" description="Power Control Register - Write Only Register, Always Read as 0">
        <bitfield id="RESETSTKYCLR" description="Clear the RESET STICKY Bit" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="Clear" value="0x1" description=""/>
        </bitfield>
        <bitfield id="RESETASSERT" description="Assert Reset to IP Domain." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="Do" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_ANACOMP1_CLKCFG" width="32" offset="0xA808" description="IP Clock Configuration Register">
        <bitfield id="BLOCKASYNC" description="Async Clock Request is blocked from starting SYSOSC or forcing bus clock to 32MHz" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="Disable" value="0x0" description=""/>
            <bitenum id="Enable" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_ANACOMP1_STAT" width="32" offset="0xA814" description="IP State Register - Read Only">
        <bitfield id="RESETSTKY" description="IP has been Reset" begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="clear" value="0x0" description=""/>
            <bitenum id="Set" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_ANACOMP2_PWREN" width="32" offset="0xC800" description="IP Enable Register">
        <bitfield id="ENABLE" description="IP Enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="Disable" value="0x0" description=""/>
            <bitenum id="Enable" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_ANACOMP2_RSTCTL" width="32" offset="0xC804" description="Power Control Register - Write Only Register, Always Read as 0">
        <bitfield id="RESETSTKYCLR" description="Clear the RESET STICKY Bit" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="Clear" value="0x1" description=""/>
        </bitfield>
        <bitfield id="RESETASSERT" description="Assert Reset to IP Domain." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="Do" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_ANACOMP2_CLKCFG" width="32" offset="0xC808" description="IP Clock Configuration Register">
        <bitfield id="BLOCKASYNC" description="Async Clock Request is blocked from starting SYSOSC or forcing bus clock to 32MHz" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="Disable" value="0x0" description=""/>
            <bitenum id="Enable" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_ANACOMP2_STAT" width="32" offset="0xC814" description="IP State Register - Read Only">
        <bitfield id="RESETSTKY" description="IP has been Reset" begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="clear" value="0x0" description=""/>
            <bitenum id="Set" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_DAC12B0_PWREN" width="32" offset="0x18800" description="IP Enable Register">
        <bitfield id="ENABLE" description="IP Enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="Disable" value="0x0" description=""/>
            <bitenum id="Enable" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_DAC12B0_RSTCTL" width="32" offset="0x18804" description="Power Control Register - Write Only Register, Always Read as 0">
        <bitfield id="RESETSTKYCLR" description="Clear the RESET STICKY Bit" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="Clear" value="0x1" description=""/>
        </bitfield>
        <bitfield id="RESETASSERT" description="Assert Reset to IP Domain." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="Do" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_DAC12B0_STAT" width="32" offset="0x18814" description="IP State Register - Read Only">
        <bitfield id="RESETSTKY" description="IP has been Reset" begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="clear" value="0x0" description=""/>
            <bitenum id="Set" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_OPAMP0_PWREN" width="32" offset="0x20800" description="IP Enable Register">
        <bitfield id="ENABLE" description="IP Enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="Disable" value="0x0" description=""/>
            <bitenum id="Enable" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_OPAMP0_RSTCTL" width="32" offset="0x20804" description="Power Control Register - Write Only Register, Always Read as 0">
        <bitfield id="RESETSTKYCLR" description="Clear the RESET STICKY Bit" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="Clear" value="0x1" description=""/>
        </bitfield>
        <bitfield id="RESETASSERT" description="Assert Reset to IP Domain." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="Do" value="0x1" description=""/>
        </bitfield>
    </register>
